evalapp/app/helpers/sessions_helper.rb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_student
    @current_student = Student.find_by_id(session[:student_id])