evalapp/app/views/feedbacks/new.html.erb

SELECT "events".* FROM "events" ORDER BY "events"."title" ASC
---
    <%= form.label :event_id %><br>
    <%= form.collection_select :event_id, Event.order(:title), :id, :title %>

SELECT "students".* FROM "students" ORDER BY "students"."name" ASC
---
    <%= form.label :student_id %><br>
    <%= form.collection_select :student_id, Student.order(:name), :id, :name %>