evalapp/app/views/events/new.html.erb

SELECT "students".* FROM "students" ORDER BY "students"."name" ASC
---
    <%= e.label :presenter %><br>
    <%= e.collection_select :presenter, Student.order(:name), :name, :name %>