evalapp/app/views/events/show.html.erb

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."event_id" = ?  [["event_id", 7]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
        </tr>
        <% @event.feedbacks.each do |f| %>
          <tr>
            <td><%= Student.find(f.student_id).name %></td>