evalapp/app/controllers/events_controller.rb

INSERT INTO "events" ("title", "desc", "created_at", "updated_at", "time") VALUES (?, ?, ?, ?, ?)  [["title", "h"], ["desc", "h"], ["created_at", "2022-04-16 23:20:56.751857"], ["updated_at", "2022-04-16 23:20:56.751857"], ["time", "2000-01-01 11:11:00"]]
---
  def create
    @event = Event.new(event_params)
    x = @event.save