evalapp/app/controllers/feedbacks_controller.rb

  def create
    @feedback = Feedback.new(feedback_params)
    @student = current_student

    if @feedback.save
---
INSERT INTO "feedbacks" ("score", "comment", "created_at", "updated_at", "student_id", "event_id") VALUES (?, ?, ?, ?, ?, ?)  [["score", 2], ["comment", "adsfadfadfsadf"], ["created_at", "2022-04-17 04:25:36.285057"], ["updated_at", "2022-04-17 04:25:36.285057"], ["student_id", nil], ["event_id", 3]]