evalapp/app/controllers/sessions_controller.rb

SELECT "students".* FROM "students" WHERE "students"."name" = ? LIMIT ?  [["name", "name"], ["LIMIT", 1]]
---
  def create
    @student = Student.find_by(name: params[:session][:name])