evalapp/app/controllers/students_controller.rb

  def homepage
    @name = Student.find(param[:id]).name
---
SELECT "students".* FROM "students" WHERE "students"."name" = ? LIMIT ?  [["name", "test"], ["LIMIT", 1]]